## Используем базовый образ с нужной версией операционной системы или языка программирования
#FROM <базовый_образ>
#
## Устанавливаем необходимые зависимости
#RUN <команда_установки_зависимостей>
#
## Копируем исходный код проекта в образ
#COPY <путь_к_исходному_коду> /<путь_в_образе>
#
## Настраиваем рабочую директорию
#WORKDIR /<путь_в_образе>
#
## Запускаем команды для сборки проекта
#RUN <команда_сборки_проекта>
#
## Указываем порт, который будет открыт в образе
#EXPOSE <порт>
#
## Задаем команду для запуска приложения или сервиса внутри контейнера
#CMD <команда_запуска_приложения>

FROM node:16

WORKDIR /users/anast/WebstormProjects/Exam2Backend

COPY . .

RUN rm package-lock.json
#RUN rm -r node_modules

RUN npm install

EXPOSE 8001

CMD npm run start
